#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # github_actions_secret.linode_token will be created
+   resource "github_actions_secret" "linode_token" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "cluster"
+       secret_name     = "LINODE_TOKEN"
+       updated_at      = (known after apply)
    }

  # linode_token.github_actions must be replaced
-/+ resource "linode_token" "github_actions" {
~       created = "2025-11-06T04:25:11Z" -> (known after apply)
~       expiry  = "2999-12-12T05:00:00Z" -> (known after apply)
~       id      = "66942680" -> (known after apply)
~       scopes  = "account:read_only domains:read_write events:read_only images:read_write linodes:read_write lke:read_write longview:read_only nodebalancers:read_write object_storage:read_write stackscripts:read_write volumes:read_write" -> "account:read_write databases:read_write domains:read_write events:read_only firewall:read_write images:read_write ips:read_write linodes:read_write lke:read_write longview:read_write nodebalancers:read_write object_storage:read_write stackscripts:read_write volumes:read_write" # forces replacement
~       token   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

</details>

*Pushed by: @andyleap, Action: `pull_request`*